### Load Libraries

In [208]:
import pandas as pd
import numpy as np

from sklearn.naive_bayes import GaussianNB
from sklearn.metrics import accuracy_score

### Load Data

In [209]:
titanic_df = pd.read_csv("dataset/titanic.csv")

In [210]:
titanic_df.sample(10)

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Ticket,Fare,Cabin,Embarked,Boat,Home/Destination
384,0.0,2.0,"Cunningham, Mr. Alfred Fleming",male,NaN,0.0,0.0,239853,0.0000,NaN,S,NaN,Belfast
878,0.0,3.0,"Ilmakangas, Miss. Pieta Sofia",female,25.0,1.0,0.0,STON/O2. 3101271,7.9250,NaN,S,NaN,NaN
1074,0.0,3.0,"O'Connor, Mr. Patrick",male,NaN,0.0,0.0,366713,7.7500,NaN,Q,NaN,NaN
814,0.0,3.0,"Gallagher, Mr. Martin",male,25.0,0.0,0.0,36864,7.7417,NaN,Q,NaN,"New York, NY"
139,1.0,1.0,"Graham, Mrs. William Thompson (Edith Junkins)",female,58.0,0.0,1.0,PC 17582,153.4625,C125,S,3,"Greenwich, CT"
389,0.0,2.0,"de Brito, Mr. Jose Joaquim",male,32.0,0.0,0.0,244360,13.0000,NaN,S,NaN,"Portugal / Sau Paulo, Brazil"
812,0.0,3.0,"Fox, Mr. Patrick",male,NaN,0.0,0.0,368573,7.7500,NaN,Q,NaN,"Ireland New York, NY"
302,1.0,1.0,"Ward, Miss. Anna",female,35.0,0.0,0.0,PC 17755,512.3292,NaN,C,3,NaN
369,0.0,2.0,"Chapman, Mrs. John Henry (Sara Elizabeth Lawry)",female,29.0,1.0,0.0,SC/AH 29037,26.0000,NaN,S,NaN,"Cornwall / Spokane, WA"
706,0.0,3.0,"Caram, Mrs. Joseph (Maria Elias)",female,NaN,1.0,0.0,2689,14.4583,NaN,C,NaN,"Ottawa, ON"

### Pre-processing

In [211]:
titanic_df.shape

(1310, 13)

In [212]:
titanic_df = titanic_df[['Sex', 'Survived']]

In [213]:
titanic_df.head()

      Sex  Survived
0  female       1.0
1    male       1.0
2  female       0.0
3    male       0.0
4  female       0.0

In [214]:
titanic_df['Sex'] = titanic_df['Sex'].astype('category', copy = False).cat.codes

In [215]:
titanic_df.head(5)

   Sex  Survived
0    0       1.0
1    1       1.0
2    0       0.0
3    1       0.0
4    0       0.0

In [216]:
titanic_df.isnull().any()

Sex         False
Survived     True
dtype: bool

In [217]:
titanic_df = titanic_df.dropna()

In [218]:
titanic_df.shape

(1309, 2)

### Splitting into train and test

In [219]:
features = titanic_df[['Sex', 'Survived']]
label = titanic_df['Survived']

In [220]:
from sklearn.model_selection import train_test_split

X_train, x_test, Y_train, y_test = train_test_split(features,
                                                    label,
                                                    test_size=0.2)

In [221]:
X_train.shape, Y_train.shape

((1047, 2), (1047,))

In [222]:
x_test.shape, y_test.shape

((262, 2), (262,))

### Computing Probabilities Manually

In [223]:
survival_num_train = Y_train.value_counts()

In [224]:
survival_num_train

0.0    641
1.0    406
Name: Survived, dtype: int64

In [225]:
survival_prob_train = survival_num_train[1] / len(Y_train) * 100

In [226]:
survival_prob_train

38.7774594078319

In [227]:
survival_num_test = y_test.value_counts()

In [228]:
survival_num_test

0.0    168
1.0     94
Name: Survived, dtype: int64

In [229]:
survival_prob_test = survival_num_test[1] / len(y_test) * 100

In [230]:
survival_prob_test

35.87786259541985

In [231]:
x_test_men.head()

     Sex  Actual Survived  Predicted Survived
196    1              1.0                 0.0
959    1              0.0                 0.0
986    1              0.0                 0.0
741    1              0.0                 0.0
246    1              0.0                 0.0

In [232]:
x_test_men = x_test.loc[x_test['Sex'] == 1]

x_test_men.shape

(167, 2)

In [233]:
x_test_women = x_test.loc[x_test['Sex'] == 0]

x_test_women.shape

(95, 2)

In [234]:
survival_num_men_test = x_test_men['Survived'].value_counts()

survival_num_men_test

0.0    144
1.0     23
Name: Survived, dtype: int64

In [235]:
survival_prob_men_test = survival_num_men_test[1] / len(x_test_men['Survived']) * 100

survival_prob_men_test

13.77245508982036

In [236]:
survival_num_women_test = x_test_women['Survived'].value_counts()

survival_num_women_test

1.0    71
0.0    24
Name: Survived, dtype: int64

In [237]:
survival_prob_women_test = survival_num_women_test[1] / len(x_test_women['Survived']) * 100

survival_prob_women_test

74.73684210526315

## Gaussian Naive Bayes model when sex is known

### Splitting into train and test

In [238]:
X_train = X_train.drop('Survived', axis=1)

x_test = x_test.drop('Survived', axis=1)

In [239]:
X_train.shape, x_test.shape

((1047, 1), (262, 1))

### Building the model

In [240]:
model = GaussianNB()

In [241]:
model.fit(X_train, Y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [242]:
y_pred = model.predict(x_test)

In [243]:
accuracy_score(y_test, y_pred)

0.8206106870229007

In [244]:
x_test['Actual Survived'] = y_test

x_test['Predicted Survived'] = y_pred

In [245]:
x_test.head()

      Sex  Actual Survived  Predicted Survived
546     0              1.0                 1.0
1192    1              0.0                 0.0
695     0              0.0                 1.0
633     1              0.0                 0.0
573     0              1.0                 1.0

In [246]:
x_test_men = x_test.loc[x_test['Sex'] == 1]

x_test_women = x_test.loc[x_test['Sex'] == 0]

In [247]:
accuracy_score(x_test_men['Actual Survived'], x_test_men['Predicted Survived'])

0.8622754491017964

In [248]:
accuracy_score(x_test_women['Actual Survived'], x_test_women['Predicted Survived'])

0.7473684210526316